Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GS610.h
#define TRGCON8 TRGCON8
extern volatile unsigned int  TRGCON8 __attribute__((__sfr__));
__extension__ typedef struct tagTRGCON8BITS {
  union {
    struct {
      unsigned TRGSTRT:6;
      unsigned :1;
      unsigned DTM:1;
      unsigned :4;
      unsigned TRGDIV:4;
    };
    struct {
      unsigned TRGSTRT0:1;
      unsigned TRGSTRT1:1;
      unsigned TRGSTRT2:1;
      unsigned TRGSTRT3:1;
      unsigned TRGSTRT4:1;
      unsigned TRGSTRT5:1;
      unsigned :6;
      unsigned TRGDIV0:1;
      unsigned TRGDIV1:1;
      unsigned TRGDIV2:1;
      unsigned TRGDIV3:1;
    };
  };
} TRGCON8BITS;
extern volatile TRGCON8BITS TRGCON8bits __attribute__((__sfr__));

#define STRIG8 STRIG8
extern volatile unsigned int  STRIG8 __attribute__((__sfr__));
__extension__ typedef struct tagSTRIG8BITS {
  union {
    struct {
      unsigned :3;
      unsigned STRGCMP:13;
    };
    struct {
      unsigned :3;
      unsigned STRGCMP0:1;
      unsigned STRGCMP1:1;
      unsigned STRGCMP2:1;
      unsigned STRGCMP3:1;
      unsigned STRGCMP4:1;
      unsigned STRGCMP5:1;
      unsigned STRGCMP6:1;
      unsigned STRGCMP7:1;
      unsigned STRGCMP8:1;
      unsigned STRGCMP9:1;
      unsigned STRGCMP10:1;
      unsigned STRGCMP11:1;
      unsigned STRGCMP12:1;
    };
  };
} STRIG8BITS;
extern volatile STRIG8BITS STRIG8bits __attribute__((__sfr__));

#define PWMCAP8 PWMCAP8
extern volatile unsigned int  PWMCAP8 __attribute__((__sfr__));
#define LEBCON8 LEBCON8
extern volatile unsigned int  LEBCON8 __attribute__((__sfr__));
typedef struct tagLEBCON8BITS {
  unsigned BPLL:1;
  unsigned BPLH:1;
  unsigned BPHL:1;
  unsigned BPHH:1;
  unsigned BCL:1;
  unsigned BCH:1;
  unsigned :4;
  unsigned CLLEBEN:1;
  unsigned FLTLEBEN:1;
  unsigned PLF:1;
  unsigned PLR:1;
  unsigned PHF:1;
  unsigned PHR:1;
} LEBCON8BITS;
extern volatile LEBCON8BITS LEBCON8bits __attribute__((__sfr__));

#define LEBDLY8 LEBDLY8
extern volatile unsigned int  LEBDLY8 __attribute__((__sfr__));
__extension__ typedef struct tagLEBDLY8BITS {
  union {
    struct {
      unsigned :3;
      unsigned LEB:9;
    };
    struct {
      unsigned :3;
      unsigned LEB0:1;
      unsigned LEB1:1;
      unsigned LEB2:1;
      unsigned LEB3:1;
      unsigned LEB4:1;
      unsigned LEB5:1;
      unsigned LEB6:1;
      unsigned LEB7:1;
      unsigned LEB8:1;
    };
  };
} LEBDLY8BITS;
extern volatile LEBDLY8BITS LEBDLY8bits __attribute__((__sfr__));

#define AUXCON8 AUXCON8
extern volatile unsigned int  AUXCON8 __attribute__((__sfr__));
__extension__ typedef struct tagAUXCON8BITS {
  union {
    struct {
      unsigned CHOPLEN:1;
      unsigned CHOPHEN:1;
      unsigned CHOPSEL:4;
      unsigned :2;
      unsigned BLANKSEL:4;
      unsigned :2;
      unsigned HRDDIS:1;
      unsigned HRPDIS:1;
    };
    struct {
      unsigned :2;
      unsigned CHOPSEL0:1;
      unsigned CHOPSEL1:1;
      unsigned CHOPSEL2:1;
      unsigned CHOPSEL3:1;
      unsigned :2;
      unsigned BLANKSEL0:1;
      unsigned BLANKSEL1:1;
      unsigned BLANKSEL2:1;
      unsigned BLANKSEL3:1;
    };
  };
} AUXCON8BITS;
extern volatile AUXCON8BITS AUXCON8bits __attribute__((__sfr__));

#define PWMCON9 PWMCON9
extern volatile unsigned int  PWMCON9 __attribute__((__sfr__));
typedef struct tagPWMCON9BITS {
  unsigned IUE:1;
  unsigned XPRES:1;
  unsigned CAM:1;
  unsigned MTBS:1;
  unsigned :1;
  unsigned DTCP:1;
  unsigned DTC:2;
  unsigned MDCS:1;
  unsigned ITB:1;
  unsigned TRGIEN:1;
  unsigned CLIEN:1;
  unsigned FLTIEN:1;
  unsigned TRGSTAT:1;
  unsigned CLSTAT:1;
  unsigned FLTSTAT:1;
} PWMCON9BITS;
extern volatile PWMCON9BITS PWMCON9bits __attribute__((__sfr__));

#define IOCON9 IOCON9
extern volatile unsigned int  IOCON9 __attribute__((__sfr__));
typedef struct tagIOCON9BITS {
  unsigned OSYNC:1;
  unsigned SWAP:1;
  unsigned CLDAT:2;
  unsigned FLTDAT:2;
  unsigned OVRDAT:2;
  unsigned OVRENL:1;
  unsigned OVRENH:1;
  unsigned PMOD:2;
  unsigned POLL:1;
  unsigned POLH:1;
  unsigned PENL:1;
  unsigned PENH:1;
} IOCON9BITS;
extern volatile IOCON9BITS IOCON9bits __attribute__((__sfr__));

#define FCLCON9 FCLCON9
extern volatile unsigned int  FCLCON9 __attribute__((__sfr__));
typedef struct tagFCLCON9BITS {
  unsigned FLTMOD:2;
  unsigned FLTPOL:1;
  unsigned FLTSRC:5;
  unsigned CLMOD:1;
  unsigned CLPOL:1;
  unsigned CLSRC:5;
  unsigned IFLTMOD:1;
} FCLCON9BITS;
extern volatile FCLCON9BITS FCLCON9bits __attribute__((__sfr__));

#define PDC9 PDC9
extern volatile unsigned int  PDC9 __attribute__((__sfr__));
#define PHASE9 PHASE9
extern volatile unsigned int  PHASE9 __attribute__((__sfr__));
#define DTR9 DTR9
extern volatile unsigned int  DTR9 __attribute__((__sfr__));
typedef struct tagDTR9BITS {
  unsigned DTR9:14;
} DTR9BITS;
extern volatile DTR9BITS DTR9bits __attribute__((__sfr__));

#define ALTDTR9 ALTDTR9
extern volatile unsigned int  ALTDTR9 __attribute__((__sfr__));
typedef struct tagALTDTR9BITS {
  unsigned ALTDTR9:14;
} ALTDTR9BITS;
extern volatile ALTDTR9BITS ALTDTR9bits __attribute__((__sfr__));

#define SDC9 SDC9
extern volatile unsigned int  SDC9 __attribute__((__sfr__));
#define SPHASE9 SPHASE9
extern volatile unsigned int  SPHASE9 __attribute__((__sfr__));
#define TRIG9 TRIG9
extern volatile unsigned int  TRIG9 __attribute__((__sfr__));
typedef struct tagTRIG9BITS {
  unsigned :3;
  unsigned TRGCMP:13;
} TRIG9BITS;
extern volatile TRIG9BITS TRIG9bits __attribute__((__sfr__));

#define TRGCON9 TRGCON9
extern volatile unsigned int  TRGCON9 __attribute__((__sfr__));
typedef struct tagTRGCON9BITS {
  unsigned TRGSTRT:6;
  unsigned :1;
  unsigned DTM:1;
  unsigned :4;
  unsigned TRGDIV:4;
} TRGCON9BITS;
extern volatile TRGCON9BITS TRGCON9bits __attribute__((__sfr__));

#define STRIG9 STRIG9
extern volatile unsigned int  STRIG9 __attribute__((__sfr__));
typedef struct tagSTRIG9BITS {
  unsigned :3;
  unsigned STRGCMP:13;
} STRIG9BITS;
extern volatile STRIG9BITS STRIG9bits __attribute__((__sfr__));

#define PWMCAP9 PWMCAP9
extern volatile unsigned int  PWMCAP9 __attribute__((__sfr__));
typedef struct tagPWMCAP9BITS {
  unsigned :3;
  unsigned PWMCAP9:13;
} PWMCAP9BITS;
extern volatile PWMCAP9BITS PWMCAP9bits __attribute__((__sfr__));

