Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GS610.h
#define _ADPCFG_PCFG4_POSITION                   0x00000004
#define _ADPCFG_PCFG4_MASK                       0x00000010
#define _ADPCFG_PCFG4_LENGTH                     0x00000001

#define _ADPCFG_PCFG5_POSITION                   0x00000005
#define _ADPCFG_PCFG5_MASK                       0x00000020
#define _ADPCFG_PCFG5_LENGTH                     0x00000001

#define _ADPCFG_PCFG6_POSITION                   0x00000006
#define _ADPCFG_PCFG6_MASK                       0x00000040
#define _ADPCFG_PCFG6_LENGTH                     0x00000001

#define _ADPCFG_PCFG7_POSITION                   0x00000007
#define _ADPCFG_PCFG7_MASK                       0x00000080
#define _ADPCFG_PCFG7_LENGTH                     0x00000001

#define _ADPCFG_PCFG8_POSITION                   0x00000008
#define _ADPCFG_PCFG8_MASK                       0x00000100
#define _ADPCFG_PCFG8_LENGTH                     0x00000001

#define _ADPCFG_PCFG9_POSITION                   0x00000009
#define _ADPCFG_PCFG9_MASK                       0x00000200
#define _ADPCFG_PCFG9_LENGTH                     0x00000001

#define _ADPCFG_PCFG10_POSITION                  0x0000000A
#define _ADPCFG_PCFG10_MASK                      0x00000400
#define _ADPCFG_PCFG10_LENGTH                    0x00000001

#define _ADPCFG_PCFG11_POSITION                  0x0000000B
#define _ADPCFG_PCFG11_MASK                      0x00000800
#define _ADPCFG_PCFG11_LENGTH                    0x00000001

#define _ADPCFG_PCFG12_POSITION                  0x0000000C
#define _ADPCFG_PCFG12_MASK                      0x00001000
#define _ADPCFG_PCFG12_LENGTH                    0x00000001

#define _ADPCFG_PCFG13_POSITION                  0x0000000D
#define _ADPCFG_PCFG13_MASK                      0x00002000
#define _ADPCFG_PCFG13_LENGTH                    0x00000001

#define _ADPCFG_PCFG14_POSITION                  0x0000000E
#define _ADPCFG_PCFG14_MASK                      0x00004000
#define _ADPCFG_PCFG14_LENGTH                    0x00000001

#define _ADPCFG_PCFG15_POSITION                  0x0000000F
#define _ADPCFG_PCFG15_MASK                      0x00008000
#define _ADPCFG_PCFG15_LENGTH                    0x00000001

#define _ADPCFG2_PCFG16_POSITION                 0x00000000
#define _ADPCFG2_PCFG16_MASK                     0x00000001
#define _ADPCFG2_PCFG16_LENGTH                   0x00000001

#define _ADPCFG2_PCFG17_POSITION                 0x00000001
#define _ADPCFG2_PCFG17_MASK                     0x00000002
#define _ADPCFG2_PCFG17_LENGTH                   0x00000001

#define _ADPCFG2_PCFG18_POSITION                 0x00000002
#define _ADPCFG2_PCFG18_MASK                     0x00000004
#define _ADPCFG2_PCFG18_LENGTH                   0x00000001

#define _ADPCFG2_PCFG19_POSITION                 0x00000003
#define _ADPCFG2_PCFG19_MASK                     0x00000008
#define _ADPCFG2_PCFG19_LENGTH                   0x00000001

#define _ADPCFG2_PCFG20_POSITION                 0x00000004
#define _ADPCFG2_PCFG20_MASK                     0x00000010
#define _ADPCFG2_PCFG20_LENGTH                   0x00000001

#define _ADPCFG2_PCFG21_POSITION                 0x00000005
#define _ADPCFG2_PCFG21_MASK                     0x00000020
#define _ADPCFG2_PCFG21_LENGTH                   0x00000001

#define _ADPCFG2_PCFG22_POSITION                 0x00000006
#define _ADPCFG2_PCFG22_MASK                     0x00000040
#define _ADPCFG2_PCFG22_LENGTH                   0x00000001

#define _ADPCFG2_PCFG23_POSITION                 0x00000007
#define _ADPCFG2_PCFG23_MASK                     0x00000080
#define _ADPCFG2_PCFG23_LENGTH                   0x00000001

#define _ADSTAT_P0RDY_POSITION                   0x00000000
#define _ADSTAT_P0RDY_MASK                       0x00000001
#define _ADSTAT_P0RDY_LENGTH                     0x00000001

#define _ADSTAT_P1RDY_POSITION                   0x00000001
#define _ADSTAT_P1RDY_MASK                       0x00000002
#define _ADSTAT_P1RDY_LENGTH                     0x00000001

#define _ADSTAT_P2RDY_POSITION                   0x00000002
#define _ADSTAT_P2RDY_MASK                       0x00000004
#define _ADSTAT_P2RDY_LENGTH                     0x00000001

#define _ADSTAT_P3RDY_POSITION                   0x00000003
#define _ADSTAT_P3RDY_MASK                       0x00000008
#define _ADSTAT_P3RDY_LENGTH                     0x00000001

#define _ADSTAT_P4RDY_POSITION                   0x00000004
#define _ADSTAT_P4RDY_MASK                       0x00000010
#define _ADSTAT_P4RDY_LENGTH                     0x00000001

#define _ADSTAT_P5RDY_POSITION                   0x00000005
#define _ADSTAT_P5RDY_MASK                       0x00000020
#define _ADSTAT_P5RDY_LENGTH                     0x00000001

#define _ADSTAT_P6RDY_POSITION                   0x00000006
#define _ADSTAT_P6RDY_MASK                       0x00000040
#define _ADSTAT_P6RDY_LENGTH                     0x00000001

#define _ADSTAT_P7RDY_POSITION                   0x00000007
#define _ADSTAT_P7RDY_MASK                       0x00000080
#define _ADSTAT_P7RDY_LENGTH                     0x00000001

#define _ADSTAT_P8RDY_POSITION                   0x00000008
#define _ADSTAT_P8RDY_MASK                       0x00000100
#define _ADSTAT_P8RDY_LENGTH                     0x00000001

#define _ADSTAT_P9RDY_POSITION                   0x00000009
#define _ADSTAT_P9RDY_MASK                       0x00000200
#define _ADSTAT_P9RDY_LENGTH                     0x00000001

#define _ADSTAT_P10RDY_POSITION                  0x0000000A
#define _ADSTAT_P10RDY_MASK                      0x00000400
#define _ADSTAT_P10RDY_LENGTH                    0x00000001

#define _ADSTAT_P11RDY_POSITION                  0x0000000B
#define _ADSTAT_P11RDY_MASK                      0x00000800
#define _ADSTAT_P11RDY_LENGTH                    0x00000001

#define _ADSTAT_P12RDY_POSITION                  0x0000000C
#define _ADSTAT_P12RDY_MASK                      0x00001000
#define _ADSTAT_P12RDY_LENGTH                    0x00000001

#define _ADCPC0_TRGSRC0_POSITION                 0x00000000
#define _ADCPC0_TRGSRC0_MASK                     0x0000001F
#define _ADCPC0_TRGSRC0_LENGTH                   0x00000005

#define _ADCPC0_SWTRG0_POSITION                  0x00000005
#define _ADCPC0_SWTRG0_MASK                      0x00000020
#define _ADCPC0_SWTRG0_LENGTH                    0x00000001

#define _ADCPC0_PEND0_POSITION                   0x00000006
#define _ADCPC0_PEND0_MASK                       0x00000040
#define _ADCPC0_PEND0_LENGTH                     0x00000001

