Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GS610.h
#define _ADCPC4_TRGSRC9_POSITION                 0x00000008
#define _ADCPC4_TRGSRC9_MASK                     0x00001F00
#define _ADCPC4_TRGSRC9_LENGTH                   0x00000005

#define _ADCPC4_SWTRG9_POSITION                  0x0000000D
#define _ADCPC4_SWTRG9_MASK                      0x00002000
#define _ADCPC4_SWTRG9_LENGTH                    0x00000001

#define _ADCPC4_PEND9_POSITION                   0x0000000E
#define _ADCPC4_PEND9_MASK                       0x00004000
#define _ADCPC4_PEND9_LENGTH                     0x00000001

#define _ADCPC4_IRQEN9_POSITION                  0x0000000F
#define _ADCPC4_IRQEN9_MASK                      0x00008000
#define _ADCPC4_IRQEN9_LENGTH                    0x00000001

#define _ADCPC5_TRGSRC10_POSITION                0x00000000
#define _ADCPC5_TRGSRC10_MASK                    0x0000001F
#define _ADCPC5_TRGSRC10_LENGTH                  0x00000005

#define _ADCPC5_SWTRG10_POSITION                 0x00000005
#define _ADCPC5_SWTRG10_MASK                     0x00000020
#define _ADCPC5_SWTRG10_LENGTH                   0x00000001

#define _ADCPC5_PEND10_POSITION                  0x00000006
#define _ADCPC5_PEND10_MASK                      0x00000040
#define _ADCPC5_PEND10_LENGTH                    0x00000001

#define _ADCPC5_IRQEN10_POSITION                 0x00000007
#define _ADCPC5_IRQEN10_MASK                     0x00000080
#define _ADCPC5_IRQEN10_LENGTH                   0x00000001

#define _ADCPC5_TRGSRC11_POSITION                0x00000008
#define _ADCPC5_TRGSRC11_MASK                    0x00001F00
#define _ADCPC5_TRGSRC11_LENGTH                  0x00000005

#define _ADCPC5_SWTRG11_POSITION                 0x0000000D
#define _ADCPC5_SWTRG11_MASK                     0x00002000
#define _ADCPC5_SWTRG11_LENGTH                   0x00000001

#define _ADCPC5_PEND11_POSITION                  0x0000000E
#define _ADCPC5_PEND11_MASK                      0x00004000
#define _ADCPC5_PEND11_LENGTH                    0x00000001

#define _ADCPC5_IRQEN11_POSITION                 0x0000000F
#define _ADCPC5_IRQEN11_MASK                     0x00008000
#define _ADCPC5_IRQEN11_LENGTH                   0x00000001

#define _ADCPC6_TRGSRC12_POSITION                0x00000000
#define _ADCPC6_TRGSRC12_MASK                    0x0000001F
#define _ADCPC6_TRGSRC12_LENGTH                  0x00000005

#define _ADCPC6_SWTRG12_POSITION                 0x00000005
#define _ADCPC6_SWTRG12_MASK                     0x00000020
#define _ADCPC6_SWTRG12_LENGTH                   0x00000001

#define _ADCPC6_PEND12_POSITION                  0x00000006
#define _ADCPC6_PEND12_MASK                      0x00000040
#define _ADCPC6_PEND12_LENGTH                    0x00000001

#define _ADCPC6_IRQEN12_POSITION                 0x00000007
#define _ADCPC6_IRQEN12_MASK                     0x00000080
#define _ADCPC6_IRQEN12_LENGTH                   0x00000001

#define _ADCPC6_TRGSRC120_POSITION               0x00000000
#define _ADCPC6_TRGSRC120_MASK                   0x00000001
#define _ADCPC6_TRGSRC120_LENGTH                 0x00000001

#define _ADCPC6_TRGSRC121_POSITION               0x00000001
#define _ADCPC6_TRGSRC121_MASK                   0x00000002
#define _ADCPC6_TRGSRC121_LENGTH                 0x00000001

#define _ADCPC6_TRGSRC122_POSITION               0x00000002
#define _ADCPC6_TRGSRC122_MASK                   0x00000004
#define _ADCPC6_TRGSRC122_LENGTH                 0x00000001

#define _ADCPC6_TRGSRC123_POSITION               0x00000003
#define _ADCPC6_TRGSRC123_MASK                   0x00000008
#define _ADCPC6_TRGSRC123_LENGTH                 0x00000001

#define _ADCPC6_TRGSRC124_POSITION               0x00000004
#define _ADCPC6_TRGSRC124_MASK                   0x00000010
#define _ADCPC6_TRGSRC124_LENGTH                 0x00000001

#define _PTCON_SEVTPS_POSITION                   0x00000000
#define _PTCON_SEVTPS_MASK                       0x0000000F
#define _PTCON_SEVTPS_LENGTH                     0x00000004

#define _PTCON_SYNCSRC_POSITION                  0x00000004
#define _PTCON_SYNCSRC_MASK                      0x00000070
#define _PTCON_SYNCSRC_LENGTH                    0x00000003

#define _PTCON_SYNCEN_POSITION                   0x00000007
#define _PTCON_SYNCEN_MASK                       0x00000080
#define _PTCON_SYNCEN_LENGTH                     0x00000001

#define _PTCON_SYNCOEN_POSITION                  0x00000008
#define _PTCON_SYNCOEN_MASK                      0x00000100
#define _PTCON_SYNCOEN_LENGTH                    0x00000001

#define _PTCON_SYNCPOL_POSITION                  0x00000009
#define _PTCON_SYNCPOL_MASK                      0x00000200
#define _PTCON_SYNCPOL_LENGTH                    0x00000001

#define _PTCON_EIPU_POSITION                     0x0000000A
#define _PTCON_EIPU_MASK                         0x00000400
#define _PTCON_EIPU_LENGTH                       0x00000001

#define _PTCON_SEIEN_POSITION                    0x0000000B
#define _PTCON_SEIEN_MASK                        0x00000800
#define _PTCON_SEIEN_LENGTH                      0x00000001

#define _PTCON_SESTAT_POSITION                   0x0000000C
#define _PTCON_SESTAT_MASK                       0x00001000
#define _PTCON_SESTAT_LENGTH                     0x00000001

#define _PTCON_PTSIDL_POSITION                   0x0000000D
#define _PTCON_PTSIDL_MASK                       0x00002000
#define _PTCON_PTSIDL_LENGTH                     0x00000001

#define _PTCON_PTEN_POSITION                     0x0000000F
#define _PTCON_PTEN_MASK                         0x00008000
#define _PTCON_PTEN_LENGTH                       0x00000001

#define _PTCON_SEVTPS0_POSITION                  0x00000000
#define _PTCON_SEVTPS0_MASK                      0x00000001
#define _PTCON_SEVTPS0_LENGTH                    0x00000001

#define _PTCON_SEVTPS1_POSITION                  0x00000001
#define _PTCON_SEVTPS1_MASK                      0x00000002
#define _PTCON_SEVTPS1_LENGTH                    0x00000001

#define _PTCON_SEVTPS2_POSITION                  0x00000002
#define _PTCON_SEVTPS2_MASK                      0x00000004
#define _PTCON_SEVTPS2_LENGTH                    0x00000001

#define _PTCON_SEVTPS3_POSITION                  0x00000003
#define _PTCON_SEVTPS3_MASK                      0x00000008
#define _PTCON_SEVTPS3_LENGTH                    0x00000001

