Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GS610.h
#define _TRGCON7_TRGSTRT3_POSITION               0x00000003
#define _TRGCON7_TRGSTRT3_MASK                   0x00000008
#define _TRGCON7_TRGSTRT3_LENGTH                 0x00000001

#define _TRGCON7_TRGSTRT4_POSITION               0x00000004
#define _TRGCON7_TRGSTRT4_MASK                   0x00000010
#define _TRGCON7_TRGSTRT4_LENGTH                 0x00000001

#define _TRGCON7_TRGSTRT5_POSITION               0x00000005
#define _TRGCON7_TRGSTRT5_MASK                   0x00000020
#define _TRGCON7_TRGSTRT5_LENGTH                 0x00000001

#define _TRGCON7_TRGDIV0_POSITION                0x0000000C
#define _TRGCON7_TRGDIV0_MASK                    0x00001000
#define _TRGCON7_TRGDIV0_LENGTH                  0x00000001

#define _TRGCON7_TRGDIV1_POSITION                0x0000000D
#define _TRGCON7_TRGDIV1_MASK                    0x00002000
#define _TRGCON7_TRGDIV1_LENGTH                  0x00000001

#define _TRGCON7_TRGDIV2_POSITION                0x0000000E
#define _TRGCON7_TRGDIV2_MASK                    0x00004000
#define _TRGCON7_TRGDIV2_LENGTH                  0x00000001

#define _TRGCON7_TRGDIV3_POSITION                0x0000000F
#define _TRGCON7_TRGDIV3_MASK                    0x00008000
#define _TRGCON7_TRGDIV3_LENGTH                  0x00000001

#define _STRIG7_STRGCMP_POSITION                 0x00000003
#define _STRIG7_STRGCMP_MASK                     0x0000FFF8
#define _STRIG7_STRGCMP_LENGTH                   0x0000000D

#define _STRIG7_STRGCMP0_POSITION                0x00000003
#define _STRIG7_STRGCMP0_MASK                    0x00000008
#define _STRIG7_STRGCMP0_LENGTH                  0x00000001

#define _STRIG7_STRGCMP1_POSITION                0x00000004
#define _STRIG7_STRGCMP1_MASK                    0x00000010
#define _STRIG7_STRGCMP1_LENGTH                  0x00000001

#define _STRIG7_STRGCMP2_POSITION                0x00000005
#define _STRIG7_STRGCMP2_MASK                    0x00000020
#define _STRIG7_STRGCMP2_LENGTH                  0x00000001

#define _STRIG7_STRGCMP3_POSITION                0x00000006
#define _STRIG7_STRGCMP3_MASK                    0x00000040
#define _STRIG7_STRGCMP3_LENGTH                  0x00000001

#define _STRIG7_STRGCMP4_POSITION                0x00000007
#define _STRIG7_STRGCMP4_MASK                    0x00000080
#define _STRIG7_STRGCMP4_LENGTH                  0x00000001

#define _STRIG7_STRGCMP5_POSITION                0x00000008
#define _STRIG7_STRGCMP5_MASK                    0x00000100
#define _STRIG7_STRGCMP5_LENGTH                  0x00000001

#define _STRIG7_STRGCMP6_POSITION                0x00000009
#define _STRIG7_STRGCMP6_MASK                    0x00000200
#define _STRIG7_STRGCMP6_LENGTH                  0x00000001

#define _STRIG7_STRGCMP7_POSITION                0x0000000A
#define _STRIG7_STRGCMP7_MASK                    0x00000400
#define _STRIG7_STRGCMP7_LENGTH                  0x00000001

#define _STRIG7_STRGCMP8_POSITION                0x0000000B
#define _STRIG7_STRGCMP8_MASK                    0x00000800
#define _STRIG7_STRGCMP8_LENGTH                  0x00000001

#define _STRIG7_STRGCMP9_POSITION                0x0000000C
#define _STRIG7_STRGCMP9_MASK                    0x00001000
#define _STRIG7_STRGCMP9_LENGTH                  0x00000001

#define _STRIG7_STRGCMP10_POSITION               0x0000000D
#define _STRIG7_STRGCMP10_MASK                   0x00002000
#define _STRIG7_STRGCMP10_LENGTH                 0x00000001

#define _STRIG7_STRGCMP11_POSITION               0x0000000E
#define _STRIG7_STRGCMP11_MASK                   0x00004000
#define _STRIG7_STRGCMP11_LENGTH                 0x00000001

#define _STRIG7_STRGCMP12_POSITION               0x0000000F
#define _STRIG7_STRGCMP12_MASK                   0x00008000
#define _STRIG7_STRGCMP12_LENGTH                 0x00000001

#define _LEBCON7_BPLL_POSITION                   0x00000000
#define _LEBCON7_BPLL_MASK                       0x00000001
#define _LEBCON7_BPLL_LENGTH                     0x00000001

#define _LEBCON7_BPLH_POSITION                   0x00000001
#define _LEBCON7_BPLH_MASK                       0x00000002
#define _LEBCON7_BPLH_LENGTH                     0x00000001

#define _LEBCON7_BPHL_POSITION                   0x00000002
#define _LEBCON7_BPHL_MASK                       0x00000004
#define _LEBCON7_BPHL_LENGTH                     0x00000001

#define _LEBCON7_BPHH_POSITION                   0x00000003
#define _LEBCON7_BPHH_MASK                       0x00000008
#define _LEBCON7_BPHH_LENGTH                     0x00000001

#define _LEBCON7_BCL_POSITION                    0x00000004
#define _LEBCON7_BCL_MASK                        0x00000010
#define _LEBCON7_BCL_LENGTH                      0x00000001

#define _LEBCON7_BCH_POSITION                    0x00000005
#define _LEBCON7_BCH_MASK                        0x00000020
#define _LEBCON7_BCH_LENGTH                      0x00000001

#define _LEBCON7_CLLEBEN_POSITION                0x0000000A
#define _LEBCON7_CLLEBEN_MASK                    0x00000400
#define _LEBCON7_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON7_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON7_FLTLEBEN_MASK                   0x00000800
#define _LEBCON7_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON7_PLF_POSITION                    0x0000000C
#define _LEBCON7_PLF_MASK                        0x00001000
#define _LEBCON7_PLF_LENGTH                      0x00000001

#define _LEBCON7_PLR_POSITION                    0x0000000D
#define _LEBCON7_PLR_MASK                        0x00002000
#define _LEBCON7_PLR_LENGTH                      0x00000001

#define _LEBCON7_PHF_POSITION                    0x0000000E
#define _LEBCON7_PHF_MASK                        0x00004000
#define _LEBCON7_PHF_LENGTH                      0x00000001

#define _LEBCON7_PHR_POSITION                    0x0000000F
#define _LEBCON7_PHR_MASK                        0x00008000
#define _LEBCON7_PHR_LENGTH                      0x00000001

#define _LEBDLY7_LEB_POSITION                    0x00000003
#define _LEBDLY7_LEB_MASK                        0x00000FF8
#define _LEBDLY7_LEB_LENGTH                      0x00000009

