Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GS610.h
#define _AUXCON8_CHOPSEL1_POSITION               0x00000003
#define _AUXCON8_CHOPSEL1_MASK                   0x00000008
#define _AUXCON8_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON8_CHOPSEL2_POSITION               0x00000004
#define _AUXCON8_CHOPSEL2_MASK                   0x00000010
#define _AUXCON8_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON8_CHOPSEL3_POSITION               0x00000005
#define _AUXCON8_CHOPSEL3_MASK                   0x00000020
#define _AUXCON8_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON8_BLANKSEL0_POSITION              0x00000008
#define _AUXCON8_BLANKSEL0_MASK                  0x00000100
#define _AUXCON8_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON8_BLANKSEL1_POSITION              0x00000009
#define _AUXCON8_BLANKSEL1_MASK                  0x00000200
#define _AUXCON8_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON8_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON8_BLANKSEL2_MASK                  0x00000400
#define _AUXCON8_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON8_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON8_BLANKSEL3_MASK                  0x00000800
#define _AUXCON8_BLANKSEL3_LENGTH                0x00000001

#define _PWMCON9_IUE_POSITION                    0x00000000
#define _PWMCON9_IUE_MASK                        0x00000001
#define _PWMCON9_IUE_LENGTH                      0x00000001

#define _PWMCON9_XPRES_POSITION                  0x00000001
#define _PWMCON9_XPRES_MASK                      0x00000002
#define _PWMCON9_XPRES_LENGTH                    0x00000001

#define _PWMCON9_CAM_POSITION                    0x00000002
#define _PWMCON9_CAM_MASK                        0x00000004
#define _PWMCON9_CAM_LENGTH                      0x00000001

#define _PWMCON9_MTBS_POSITION                   0x00000003
#define _PWMCON9_MTBS_MASK                       0x00000008
#define _PWMCON9_MTBS_LENGTH                     0x00000001

#define _PWMCON9_DTCP_POSITION                   0x00000005
#define _PWMCON9_DTCP_MASK                       0x00000020
#define _PWMCON9_DTCP_LENGTH                     0x00000001

#define _PWMCON9_DTC_POSITION                    0x00000006
#define _PWMCON9_DTC_MASK                        0x000000C0
#define _PWMCON9_DTC_LENGTH                      0x00000002

#define _PWMCON9_MDCS_POSITION                   0x00000008
#define _PWMCON9_MDCS_MASK                       0x00000100
#define _PWMCON9_MDCS_LENGTH                     0x00000001

#define _PWMCON9_ITB_POSITION                    0x00000009
#define _PWMCON9_ITB_MASK                        0x00000200
#define _PWMCON9_ITB_LENGTH                      0x00000001

#define _PWMCON9_TRGIEN_POSITION                 0x0000000A
#define _PWMCON9_TRGIEN_MASK                     0x00000400
#define _PWMCON9_TRGIEN_LENGTH                   0x00000001

#define _PWMCON9_CLIEN_POSITION                  0x0000000B
#define _PWMCON9_CLIEN_MASK                      0x00000800
#define _PWMCON9_CLIEN_LENGTH                    0x00000001

#define _PWMCON9_FLTIEN_POSITION                 0x0000000C
#define _PWMCON9_FLTIEN_MASK                     0x00001000
#define _PWMCON9_FLTIEN_LENGTH                   0x00000001

#define _PWMCON9_TRGSTAT_POSITION                0x0000000D
#define _PWMCON9_TRGSTAT_MASK                    0x00002000
#define _PWMCON9_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON9_CLSTAT_POSITION                 0x0000000E
#define _PWMCON9_CLSTAT_MASK                     0x00004000
#define _PWMCON9_CLSTAT_LENGTH                   0x00000001

#define _PWMCON9_FLTSTAT_POSITION                0x0000000F
#define _PWMCON9_FLTSTAT_MASK                    0x00008000
#define _PWMCON9_FLTSTAT_LENGTH                  0x00000001

#define _IOCON9_OSYNC_POSITION                   0x00000000
#define _IOCON9_OSYNC_MASK                       0x00000001
#define _IOCON9_OSYNC_LENGTH                     0x00000001

#define _IOCON9_SWAP_POSITION                    0x00000001
#define _IOCON9_SWAP_MASK                        0x00000002
#define _IOCON9_SWAP_LENGTH                      0x00000001

#define _IOCON9_CLDAT_POSITION                   0x00000002
#define _IOCON9_CLDAT_MASK                       0x0000000C
#define _IOCON9_CLDAT_LENGTH                     0x00000002

#define _IOCON9_FLTDAT_POSITION                  0x00000004
#define _IOCON9_FLTDAT_MASK                      0x00000030
#define _IOCON9_FLTDAT_LENGTH                    0x00000002

#define _IOCON9_OVRDAT_POSITION                  0x00000006
#define _IOCON9_OVRDAT_MASK                      0x000000C0
#define _IOCON9_OVRDAT_LENGTH                    0x00000002

#define _IOCON9_OVRENL_POSITION                  0x00000008
#define _IOCON9_OVRENL_MASK                      0x00000100
#define _IOCON9_OVRENL_LENGTH                    0x00000001

#define _IOCON9_OVRENH_POSITION                  0x00000009
#define _IOCON9_OVRENH_MASK                      0x00000200
#define _IOCON9_OVRENH_LENGTH                    0x00000001

#define _IOCON9_PMOD_POSITION                    0x0000000A
#define _IOCON9_PMOD_MASK                        0x00000C00
#define _IOCON9_PMOD_LENGTH                      0x00000002

#define _IOCON9_POLL_POSITION                    0x0000000C
#define _IOCON9_POLL_MASK                        0x00001000
#define _IOCON9_POLL_LENGTH                      0x00000001

#define _IOCON9_POLH_POSITION                    0x0000000D
#define _IOCON9_POLH_MASK                        0x00002000
#define _IOCON9_POLH_LENGTH                      0x00000001

#define _IOCON9_PENL_POSITION                    0x0000000E
#define _IOCON9_PENL_MASK                        0x00004000
#define _IOCON9_PENL_LENGTH                      0x00000001

#define _IOCON9_PENH_POSITION                    0x0000000F
#define _IOCON9_PENH_MASK                        0x00008000
#define _IOCON9_PENH_LENGTH                      0x00000001

#define _FCLCON9_FLTMOD_POSITION                 0x00000000
#define _FCLCON9_FLTMOD_MASK                     0x00000003
#define _FCLCON9_FLTMOD_LENGTH                   0x00000002

#define _FCLCON9_FLTPOL_POSITION                 0x00000002
#define _FCLCON9_FLTPOL_MASK                     0x00000004
#define _FCLCON9_FLTPOL_LENGTH                   0x00000001

