Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GS610.h
#define ICS_NONE             0xFFFC
#define ICS_PGD3             0xFFFD
#define ICS_PGD2             0xFFFE
#define ICS_PGD1             0xFFFF

#define JTAGEN_OFF           0xFFDF
#define JTAGEN_ON            0xFFFF

/* Register FCMP (0xf80010)                               */

extern __attribute__((space(prog))) unsigned int _FCMP;
#define _FCMP(x) __attribute__((section("__FCMP.sec"),space(prog))) unsigned int _FCMP = (x);

/*
** Only one invocation of FCMP should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FCMP.
** Multiple options may be combined, as shown:
**
** _FCMP( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Even Comparator Hysteresis Select:
**     HYST0_HYST0          No Hysteresis
**     HYST0_HYST15         15 mV Hysteresis
**     HYST0_HYST30         30 mV Hysteresis
**     HYST0_HYST45         45 mV Hysteresis
**
**   Comparator Hysteresis Polarity (for even numbered comparators):
**     CMPPOL0_POL_RISE     Hysteresis is applied to rising edge
**     CMPPOL0_POL_FALL     Hysteresis is applied to falling edge
**
**   Odd Comparator Hysteresis Select:
**     HYST1_HYST0          No Hysteresis
**     HYST1_HYST15         15 mV Hysteresis
**     HYST1_HYST30         30 mV Hysteresis
**     HYST1_HYST45         45 mV Hysteresis
**
**   Comparator Hysteresis Polarity (for odd numbered comparators):
**     CMPPOL1_POL_RISE     Hysteresis is applied to rising edge
**     CMPPOL1_POL_FALL     Hysteresis is applied to falling edge
**
*/

#define HYST0_HYST0          0xFFFC
#define HYST0_HYST15         0xFFFD
#define HYST0_HYST30         0xFFFE
#define HYST0_HYST45         0xFFFF

#define CMPPOL0_POL_RISE     0xFFFB
#define CMPPOL0_POL_FALL     0xFFFF

#define HYST1_HYST0          0xFFE7
#define HYST1_HYST15         0xFFEF
#define HYST1_HYST30         0xFFF7
#define HYST1_HYST45         0xFFFF

#define CMPPOL1_POL_RISE     0xFFDF
#define CMPPOL1_POL_FALL     0xFFFF



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x5600

#define __FBS_BASE 0xf80000
#define __FBS_LENGTH 0x2

#define __FGS_BASE 0xf80004
#define __FGS_LENGTH 0x2

#define __FOSCSEL_BASE 0xf80006
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xf80008
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xf8000a
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xf8000c
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xf8000e
#define __FICD_LENGTH 0x2

#define __FCMP_BASE 0xf80010
#define __FCMP_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x1000


#endif
